## Env: `staging`
#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
#### Terraform Plan `success`
<details><summary>Show Plan</summary>

```

module.sqs.aws_sqs_queue.il01_analyzer_queue: Refreshing state... [id=https://sqs.us-east-2.amazonaws.com/043309351324/il01_analyzer_queue_stg]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.sqs.aws_sqs_queue.il01_analyzer_queue must be replaced
-/+ resource "aws_sqs_queue" "il01_analyzer_queue" {
      ~ arn                               = "arn:aws:sqs:us-east-2:043309351324:il01_analyzer_queue_stg" -> (known after apply)
      + deduplication_scope               = (known after apply)
      + fifo_throughput_limit             = (known after apply)
      ~ id                                = "https://sqs.us-east-2.amazonaws.com/043309351324/il01_analyzer_queue_stg" -> (known after apply)
      ~ kms_data_key_reuse_period_seconds = 300 -> (known after apply)
      ~ name                              = "il01_analyzer_queue_stg" -> "il01_analyzer_stg" # forces replacement
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      ~ sqs_managed_sse_enabled           = true -> (known after apply)
      ~ tags                              = {
            "Environment" = "stg"
          ~ "Name"        = "il01_analyzer_queue_stg" -> "il01_analyzer_stg"
        }
      ~ tags_all                          = {
          ~ "Name"        = "il01_analyzer_queue_stg" -> "il01_analyzer_stg"
            # (1 unchanged element hidden)
        }
      ~ url                               = "https://sqs.us-east-2.amazonaws.com/043309351324/il01_analyzer_queue_stg" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ il01_analyzer_queue_arn = "arn:aws:sqs:us-east-2:043309351324:il01_analyzer_queue_stg" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Action: `pull_request`*